{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Задача №1\n",
    "## Кто самый умный супергерой?\n",
    "Есть API по информации о супергероях с информацией по всем супергероям. \n",
    "Нужно определить кто самый умный(intelligence) из трех супергероев- Hulk, Captain America, Thanos."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "import requests\n",
    "\n",
    "\n",
    "#Список со словарями для всех супергероев\n",
    "file_list = [] \n",
    "url = ('https://akabab.github.io/superhero-api/api/all.json') \n",
    "response = requests.get(url)\n",
    "file_list.extend(response.json())\n",
    "\n",
    "#Функция для создания словаря, где ключ-имя супергероя, значение-нужная нам характеристика\n",
    "hero_intel = {}\n",
    "def hero_rat(name):\n",
    "    for hero_dir in file_list:           \n",
    "        hero_name = hero_dir['name']  \n",
    "        hero_powerstats = hero_dir['powerstats']       \n",
    "        if hero_name == name:            \n",
    "            hero_com = {hero_name: hero_powerstats['intelligence']}\n",
    "            hero_intel.update(hero_com)\n",
    "\n",
    "#Заполняем словарь    \n",
    "hero_rat('Hulk')\n",
    "hero_rat('Captain America')\n",
    "hero_rat('Thanos')\n",
    "\n",
    "#Сортируем словарь по значению\n",
    "sorted_tuples = sorted(hero_intel.items(), key=lambda item: item[1])\n",
    "sorted_dict = {k: v for k, v in sorted_tuples}\n",
    "hero_list = list(sorted_dict.keys())\n",
    "#Вывод\n",
    "print(f'Самый умный супергерой: {hero_list[-1]}' ) \n",
    "    \n",
    "    \n",
    " \n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Задача №2\n",
    "## У Яндекс.Диска есть очень удобное и простое API. Для описания всех его методов существует Полигон. Нужно написать программу, которая принимает на вход путь до файла на компьютере и сохраняет на Яндекс.Диск с таким же именем.\n",
    "\n",
    "### Все ответы приходят в формате json;\n",
    "### Загрузка файла по ссылке происходит с помощью метода put и передачи туда данных;\n",
    "### Токен можно получить кликнув на полигоне на кнопку \"Получить OAuth-токен\".\n",
    "HOST: https://cloud-api.yandex.net:443\n",
    "\n",
    "Важно: Токен публиковать в github не нужно, переменную для токена нужно оставить пустой!\n",
    "\n",
    "### Шаблон для программы\n",
    "\n",
    "class YaUploader:\n",
    "    def __init__(self, token: str):\n",
    "        self.token = token\n",
    "\n",
    "    def upload(self, file_path: str):\n",
    "        \"\"\"Метод загружает файлы по списку file_list на яндекс диск\"\"\"\n",
    "        # Тут ваша логика\n",
    "        # Функция может ничего не возвращать\n",
    "\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    # Получить путь к загружаемому файлу и токен от пользователя\n",
    "    path_to_file = ...\n",
    "    token = ...\n",
    "    uploader = YaUploader(token)\n",
    "    result = uploader.upload(path_to_file)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "from pprint import pprint\n",
    "class YandexDisk:\n",
    "\n",
    "    def __init__(self, token):\n",
    "        self.token = token\n",
    "\n",
    "\n",
    "\n",
    " \n",
    "\n",
    "    def _get_upload_link(self, disk_file_path):\n",
    "        upload_url = \"https://cloud-api.yandex.net/v1/disk/resources/upload\"\n",
    "        headers = self.get_headers()\n",
    "        params = {\"path\": disk_file_path, \"overwrite\": \"true\"}\n",
    "        response = requests.get(upload_url, headers=headers, params=params)\n",
    "        pprint(response.json())\n",
    "        return response.json()\n",
    "\n",
    "    def upload_file_to_disk(self, disk_file_path, filename):\n",
    "        resalt =  self._get_upload_link(disk_file_path=disk_file_path)\n",
    "        href = resalt.get(\"href\", \"\")\n",
    "        response = requests.put(href, data=open(filename, 'rb'))\n",
    "        response.raise_for_status()\n",
    "        if response.status_code == 201:\n",
    "            print(\"Success\")\n",
    "\n",
    "\n",
    "\n",
    "    \n",
    "def file_token_ya():\n",
    "    with open('C:/Users/Admin/Desktop/tokens/token_ya.txt', 'rt', encoding = 'utf-8') as f:\n",
    "        d = f.read()\n",
    "        return d\n",
    "\n",
    "TOKEN = file_token_ya()\n",
    "if  __name__ == '__main__':\n",
    "    ya = YandexDisk(token=TOKEN)\n",
    "    ya.upload_file_to_disk('disk_file_path', 'text.txt')\n",
    "\n",
    "\n",
    "\n",
    "            "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.8 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.8"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "a42ccb73e7d9bfdf27e036f1d2b8b681e55fc0743cc5586bc2474d4a60f4b886"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
